Table of Contents
 Class TendonDuct
Namespace
IdeaRS.OpenModel.CrossSection
Assembly
IdeaRS.OpenModel.dll
Tendon duct
[OpenModelClass("CI.Services.Concrete.ReinforcedSection.TendonDuct,CI.ReinforcedSection")]
public class TendonDuct : OpenObject
Inheritance
object
OpenObject
TendonDuct
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Diameter
Diameter
public double Diameter { get; set; }
Property Value
double
 Id
Tendon duct Id
public int Id { get; set; }
Property Value
int
 IsDebondingTube
rue for debonding tubes, false for tendon ducts
public bool IsDebondingTube { get; set; }
Property Value
bool
 MaterialDuct
Tendon duct material
public MaterialDuct MaterialDuct { get; set; }
Property Value
MaterialDuct
 Point
Position of duct
[OpenModelProperty("CentrePoint")]
public Point2D Point { get; set; }
Property Value
Point2D
 Edit this page